nicslabdev/MOTAM-nRF52_Beacons/intelligent_traffic_light/main.c
// Function for initializing the Advertising functionality
static void advertising_init(void)
{
    ret_code_t err_code;

    // Set the advertising parameters
    m_adv_params.properties.type= BLE_GAP_ADV_TYPE_EXTENDED_NONCONNECTABLE_NONSCANNABLE_UNDIRECTED;  // Extended advertising
    m_adv_params.p_peer_addr    = NULL;                                                    // Undirected advertisement
    m_adv_params.interval       = ADV_INTERVAL;                                            // Time between advertisements
    m_adv_params.duration       = BLE_GAP_ADV_TIMEOUT_GENERAL_UNLIMITED;                   // Never time out
    m_adv_params.max_adv_evts   = 0;                                                       // No limit of advertising events
    m_adv_params.filter_policy  = BLE_GAP_ADV_FP_ANY;                                      // Allow scan request from any device
    m_adv_params.primary_phy    = BLE_GAP_PHY_CODED;                                       // Long range codification
    m_adv_params.secondary_phy  = BLE_GAP_PHY_CODED;                                       // Long range codification

    // Set the advertising data
    m_adv_data.adv_data.len = 0;                                                            // Still no data on frame
    m_adv_data.adv_data.p_data = m_enc_advdata_1;

    err_code = sd_ble_gap_adv_set_configure(&m_adv_handle, &m_adv_data, &m_adv_params);
    APP_ERROR_CHECK(err_code);
}

// Build beacon frame with MOTAM beacon structure
static void frame_init (void)
{
    sign_frame();                                                                           // Generate ECDSA signature of frame and include it on it
    memset(m_adv_data.adv_data.p_data, 0, BLE_GAP_ADV_SET_DATA_SIZE_EXTENDED_MAX_SUPPORTED);
    m_adv_data.adv_data.len = sizeof(frame);
    memcpy (m_adv_data.adv_data.p_data, frame, sizeof(frame));
}

// Function for starting advertising
static void advertising_start(void)
{
    ret_code_t err_code;
    err_code = sd_ble_gap_adv_start(m_adv_handle, APP_BLE_CONN_CFG_TAG);
    APP_ERROR_CHECK(err_code);
}

// Function for updating advertising data
static void advertising_update (uint8_t * new_frame, uint8_t new_frame_size)
{
    ret_code_t err_code;

    static uint8_t advdata_flag = 1;                                                        // Last enc_advdata used. 
                                                                                            // Necessary in order to dinamically update adv data
    if (advdata_flag == 1)
    {
        memcpy (m_enc_advdata_2, new_frame, new_frame_size);
        m_adv_data.adv_data.p_data = m_enc_advdata_2;
        advdata_flag = 2;
    }
    else
    {
        memcpy (m_enc_advdata_1, new_frame, new_frame_size);
        m_adv_data.adv_data.p_data = m_enc_advdata_1;
        advdata_flag = 1;
    }

    m_adv_data.adv_data.len = new_frame_size;

    err_code = sd_ble_gap_adv_set_configure(&m_adv_handle, &m_adv_data, NULL);
    APP_ERROR_CHECK(err_code);
}

// BLE events handler
static void ble_evt_handler(ble_evt_t const * p_ble_evt, void * p_context)
{
    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_ADV_REPORT:
            break;

        default:
            break;
    }
}

static void radio_active_handler ( bool radio_active );

// Radio notification will notify when an advertisement is sent
static void radio_notification_init (void)
{
    uint32_t err_code;

    err_code = ble_radio_notification_init
        (
        APP_IRQ_PRIORITY_LOW,
        NRF_RADIO_NOTIFICATION_DISTANCE_800US,
        radio_active_handler
        );
    APP_ERROR_CHECK(err_code);
}

// Handler for radio notification interruption (radio active and nonactive)
static void radio_active_handler ( bool radio_active )
{
    if (radio_active == false)
    {
        advertising_update (frame, sizeof(frame));
    }
}


// Function for updating 


// ======== Crypto configuration ========

// Intelligent Traffic Light private key in byte array format
static const uint8_t private_key_byte_array [] =
{
    0x80, 0xD2, 0xEF, 0x9D, 0x30, 0x4D, 0x6A, 0x84,
    0x04, 0x53, 0x00, 0xFA, 0x4A, 0x61, 0x46, 0xB3,
    0x7D, 0xB2, 0x19, 0xCA, 0x2F, 0x9D, 0x25, 0x52,
    0x75, 0xCA, 0x62, 0x58, 0x24, 0x43, 0xC5, 0x74,
};


// Intelligent Traffic Light public key in byte array format
static const uint8_t public_key_byte_array[] =
{
    0x40, 0xCD, 0xA5, 0xA4, 0xFF, 0x1E, 0xA3, 0xAE,
    0xCC, 0x67, 0x8E, 0xED, 0xF6, 0x36, 0x34, 0x9D,
    0x5B, 0x2D, 0xB7, 0x86, 0xAC, 0xA0, 0xD6, 0xA0,
    0xFB, 0x0F, 0xC9, 0xAE, 0x3A, 0x39, 0x14, 0x34,
    0xDE, 0x52, 0xEE, 0xAC, 0xA8, 0xE0, 0xCD, 0xC3,
    0x0C, 0xFA, 0xC6, 0xCF, 0x4D, 0xBF, 0x54, 0xDC,
    0x9F, 0x43, 0x9A, 0xE8, 0x9A, 0x48, 0xA0, 0x8D,
    0x87, 0xB1, 0xF1, 0x95, 0xE0, 0x50, 0x87, 0x45,
};



static nrf_crypto_ecc_private_key_t             private_key;                                // Intelligent Traffic Light private key in internal representation
static nrf_crypto_ecc_public_key_t              public_key;                                 // Intelligent Traffic Light public key in internal representation
static nrf_crypto_ecdsa_secp256k1_signature_t   signature;                                  // Advertising frame data ECDSA signature
static size_t                                   signature_size;

// Function for initializing the crypto module
static void crypto_init ()
{
    ret_code_t err_code;

    err_code = nrf_crypto_init();
    APP_ERROR_CHECK(err_code);

    err_code = nrf_crypto_ecc_private_key_from_raw
        (
        &g_nrf_crypto_ecc_secp256k1_curve_info,
        &private_key,
        private_key_byte_array,
        sizeof(private_key_byte_array)
        );

    APP_ERROR_CHECK(err_code);
}


// Function for generating ECDSA advertising signature and include it on the frame
static void sign_frame ()
{
    ret_code_t err_code;

    nrf_crypto_hash_context_t hash_context;
    nrf_crypto_hash_sha256_digest_t hash_digest;
    size_t digest_size = sizeof(hash_digest);

    // Not all the frame must be signed. Discarding the signature field of advertising frame...
    uint8_t frame_data [BEACON_FRAME_LENGTH - NRF_CRYPTO_ECDSA_SECP256K1_SIGNATURE_SIZE];
    uint32_t frame_data_size = sizeof(frame_data);
    memcpy(frame_data,frame,frame_data_size);

