nicslabdev/MOTAM-nRF52_Beacons/intelligent_traffic_light/main.c
    // It's necessary generating the hash of data before of sign
    err_code = nrf_crypto_hash_calculate
    (
        &hash_context,                                                                      // Context
        &g_nrf_crypto_hash_sha256_info,                                                     // Info structure
        frame_data,                                                                         // Input buffer
        frame_data_size,                                                                    // Input size
        hash_digest,                                                                        // Result buffer
        &digest_size                                                                        // Result size
    );
    APP_ERROR_CHECK(err_code);

    // Generate the signature of data
    signature_size = sizeof(signature);
    err_code = nrf_crypto_ecdsa_sign(NULL,
                                     &private_key,
                                     hash_digest,
                                     digest_size,
                                     signature,
                                     &signature_size);
    APP_ERROR_CHECK(err_code);

    memcpy(&frame[BEACON_FRAME_LENGTH-NRF_CRYPTO_ECDSA_SECP256K1_SIGNATURE_SIZE],signature,signature_size);
}


// ======== GPIO and timers initialization ========

// GPIO LED parameters
#define LED_RED                                 NRF_GPIO_PIN_MAP(0,13)
#define LED_YELLOW                              NRF_GPIO_PIN_MAP(0,14)
#define LED_GREEN                               NRF_GPIO_PIN_MAP(0,15)
//#define LED_RED                                 NRF_GPIO_PIN_MAP(1,10)
//#define LED_YELLOW                              NRF_GPIO_PIN_MAP(1,13)
//#define LED_GREEN                               NRF_GPIO_PIN_MAP(1,15)
#define LED_RED_PEDESTRIAN 			NRF_GPIO_PIN_MAP(0,29)
#define LED_GREEN_PEDESTRIAN			NRF_GPIO_PIN_MAP(0,31)


#define DURATION_RED 				APP_TIMER_TICKS(RED_STATE_DURATION*1000)    // Duration of red state in milliseconds
#define DURATION_YELLOW 			APP_TIMER_TICKS(YELLOW_STATE_DURATION*1000) // Duration of yellow state in milliseconds
#define DURATION_GREEN 				APP_TIMER_TICKS(GREEN_STATE_DURATION*1000)  // Duration of green state in milliseconds
#define DURATION_BLINKY				APP_TIMER_TICKS(BLINKY_STATE_DURATION*1000) // Duration of blinky in pedestrian green state in milliseconds

APP_TIMER_DEF (timer);                                                                      // Timer instance for traffic
APP_TIMER_DEF (timer_pedestrian);                                                           // Timer instance for pedestrian blinky green light
APP_TIMER_DEF (timer_frame_update);                                                         // Timer instance for adv frame update (change state, recalculate crypto signature...)

// Put all LEDs to low
static void pins_clear ()
{
    nrf_gpio_pin_clear(LED_RED);
    nrf_gpio_pin_clear(LED_YELLOW);
    nrf_gpio_pin_clear(LED_GREEN);
    nrf_gpio_pin_clear(LED_RED_PEDESTRIAN);
    nrf_gpio_pin_clear(LED_GREEN_PEDESTRIAN);
}


// GPIO ports initialization
static void gpio_init()
{
    nrf_gpio_cfg                                                                            // Set up of Red Light
    (
        LED_RED,
        NRF_GPIO_PIN_DIR_OUTPUT,
        NRF_GPIO_PIN_INPUT_DISCONNECT,
        NRF_GPIO_PIN_PULLUP,
        NRF_GPIO_PIN_H0H1,
        NRF_GPIO_PIN_NOSENSE
    );
    nrf_gpio_cfg                                                                            // Set up of Yellow Light
    (
        LED_YELLOW,
        NRF_GPIO_PIN_DIR_OUTPUT,
        NRF_GPIO_PIN_INPUT_DISCONNECT,
        NRF_GPIO_PIN_PULLUP,
        NRF_GPIO_PIN_H0H1,
        NRF_GPIO_PIN_NOSENSE
    );
    nrf_gpio_cfg                                                                            // Set up of Green Light
    (
        LED_GREEN,
        NRF_GPIO_PIN_DIR_OUTPUT,
        NRF_GPIO_PIN_INPUT_DISCONNECT,
        NRF_GPIO_PIN_PULLUP,
        NRF_GPIO_PIN_H0H1,
        NRF_GPIO_PIN_NOSENSE
    );
    nrf_gpio_cfg                                                                            // Set up of Green Light
    (
        LED_RED_PEDESTRIAN,
        NRF_GPIO_PIN_DIR_OUTPUT,
        NRF_GPIO_PIN_INPUT_DISCONNECT,
        NRF_GPIO_PIN_PULLUP,
        NRF_GPIO_PIN_H0H1,
        NRF_GPIO_PIN_NOSENSE
    );
    nrf_gpio_cfg                                                                            // Set up of Green Light
    (
        LED_GREEN_PEDESTRIAN,
        NRF_GPIO_PIN_DIR_OUTPUT,
        NRF_GPIO_PIN_INPUT_DISCONNECT,
        NRF_GPIO_PIN_PULLUP,
        NRF_GPIO_PIN_H0H1,
        NRF_GPIO_PIN_NOSENSE
    );

    pins_clear();                                                                           // Set all leds to low
}

// Handle the timers: this will change the state of the traffic light
static void timer_handler (void *p_context)
{
    ret_code_t err_code;

    pins_clear();                                                                           // Set all leds to low

    if (lastState == RED_STATE)
    {
        currentState = GREEN_STATE;                                                         // New state: green
        nrf_gpio_pin_set(LED_GREEN);                                                        // Turn on green light
        nrf_gpio_pin_set(LED_RED_PEDESTRIAN);
        err_code = app_timer_start ( timer, DURATION_GREEN, NULL);
        APP_ERROR_CHECK(err_code);
    }
    else if (lastState == GREEN_STATE)
    {
        currentState = YELLOW_STATE;                                                        // New state: yellow
        nrf_gpio_pin_set(LED_YELLOW);                                                       // Turn on green light
        nrf_gpio_pin_set(LED_RED_PEDESTRIAN);                                               // Turn on pedestrian red light
        err_code = app_timer_start ( timer, DURATION_YELLOW, NULL);
        APP_ERROR_CHECK(err_code);
    }
    else if (lastState == YELLOW_STATE)
    {
        currentState = RED_STATE;                                                           // New state: red
        nrf_gpio_pin_set(LED_RED);                                                          // Turn on red lightb
        nrf_gpio_pin_set(LED_GREEN_PEDESTRIAN);                                             // Turn on pedestrian green light
        err_code = app_timer_start (timer, DURATION_RED, NULL);
        APP_ERROR_CHECK(err_code);
        err_code = app_timer_start (timer_pedestrian, (DURATION_RED-DURATION_BLINKY), NULL);// Start timer in order to start pedestrian blinky state
        APP_ERROR_CHECK(err_code);
    }

    lastState = currentState;
    lastStateTicks = app_timer_cnt_get();
}

